Now we see Different ways of creations of DataFrame

In [9]:
import pandas as pd
import numpy as np

In [3]:
data = [["harry", 34], ["Jill", 67], ["Jacob", 56], ["Subham", 97]]
data

[['harry', 34], ['Jill', 67], ['Jacob', 56], ['Subham', 97]]

In [4]:
pd.DataFrame(data, columns=["Name", "Marks"])

     Name  Marks
0   harry     34
1    Jill     67
2   Jacob     56
3  Subham     97

In [5]:
data = {"a" : [2, 6, 7, 3], "b" : [56, 34, 343, 54]}

In [6]:
data

{'a': [2, 6, 7, 3], 'b': [56, 34, 343, 54]}

In [7]:
pd.DataFrame(data)

   a    b
0  2   56
1  6   34
2  7  343
3  3   54

DataFrame From Numpy Arrays

In [10]:
arr = np.array([[1,2], [3,4]])
df = pd.DataFrame(arr, columns=["A","B"])
df

   A  B
0  1  2
1  3  4

In [11]:
pd.read_excel("data.xlsx")

      Name School  Marks
0  Shubham    SPS     34
1   Joshua    UPS     45
2     Jack    WPS     56
3     Alex    UIS     67
4  Jasmine    RTS     78
5    Rohan    RRS     89
6    Rishi    PES    100
7   Aakash    DPS     51

we can read data from csv files
using "pd.read_csv(filename)"

we can read data from json files
using "pd.read_json(filename)"

In [16]:
# here we learn how to read data from url
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df = pd.read_csv(url)
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

EDA - Exploratory Data Analysis
EDA is essential First Step in any Data Science Project

It involves Deep look into the Dataset to understand its structure, spot pattern, identify anomalies and uncover relationships between variables.
The Goal of EDA is to get a clear picture of what the data is telling you before applying any analysis or machine learning models.

In [17]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [18]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [21]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000